### Pandas DataFrame And Serires
Pandas is a powerfull data manipululation library in Python, widely used for data analysis and data cleaning. It provides two primay data structures: Serires and DataFrame. A serires is a one-dimensional array-like object while DataFrame is two dimensional, size-mutable and potentially heterogeneous tabular data structure with labeled axes ( rows and columns).

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\abdul\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
# Series 
# Pandas series is a one-dimensional array like object that can hold any data type. It is similar to column in table

data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
# create a series from dictionary
data = {'a':1,'b':2, 'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [6]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
# DataFrame
# Create a dataframe from a dictionary of list

data = {
    'Name':['krish','omer','ali'],
    'age':[20,30,40],
    'city':['lahore','karachi','Is']
} 
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  age     city
0  krish   20   lahore
1   omer   30  karachi
2    ali   40       Is
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['krish', 20, 'lahore'],
       ['omer', 30, 'karachi'],
       ['ali', 40, 'Is']], dtype=object)

In [9]:
# Create a DataFrame from ta list of Dcitionaries
data = [
    {'Name': 'krish','age': 30,'city':'lahore'},
    {'Name': 'Omer','age': 40,'city':'lahore'},
    {'Name': 'Talha','age': 60,'city':'lahore'}
]
df = pd.DataFrame(data)
print(df)

    Name  age    city
0  krish   30  lahore
1   Omer   40  lahore
2  Talha   60  lahore

In [12]:
df = pd.read_csv('sales_data.csv')
print(df)
print(type(df))

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]
<class 'pandas.core.frame.DataFrame'>

In [14]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [19]:
df.mean

<bound method DataFrame.mean of      Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]>

In [23]:
# Accessing the data from data frame
data = [
    {'Name': 'krish', 'age': 30, 'city': 'lahore'},
    {'Name': 'Omer', 'age': 40, 'city': 'lahore'},
    {'Name': 'Talha', 'age': 60, 'city': 'lahore'}
]
df = pd.DataFrame(data)
df['Name']

0    krish
1     Omer
2    Talha
Name: Name, dtype: object

In [25]:
df.loc[0]

Name     krish
age         30
city    lahore
Name: 0, dtype: object

In [27]:
df.iloc[0]

Name     krish
age         30
city    lahore
Name: 0, dtype: object

In [28]:
df.iloc[0][0]

C:\Users\abdul\AppData\Local\Temp\ipykernel_13952\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'krish'

In [32]:
df

    Name  age    city
0  krish   30  lahore
1   Omer   40  lahore
2  Talha   60  lahore

In [31]:
# Accessing a specified element
df.at[1,'age']

40

In [33]:
df.iat[2,2]

'lahore'

In [34]:
# Data Manipulation with dataframes
df

    Name  age    city
0  krish   30  lahore
1   Omer   40  lahore
2  Talha   60  lahore

In [36]:
df['salary'] = [100,200,300]

In [37]:
df

    Name  age    city  salary
0  krish   30  lahore     100
1   Omer   40  lahore     200
2  Talha   60  lahore     300

In [43]:
# Remve a drop
df.drop('salary',axis=1,inplace=True)

In [45]:
df

    Name  age    city
0  krish   30  lahore
1   Omer   40  lahore
2  Talha   60  lahore

In [50]:
# Add age to column
df['age'] = df['age']+4

In [57]:
df

    Name  age    city
1   Omer   46  lahore
2  Talha   66  lahore

In [58]:
# df.drop(0,inplace=True)

In [60]:
df = pd.read_csv('sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [61]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000